const buptmapping = {
    0: { 'id': 0, 'name': '西门', 'x': '27.88', 'y': '114.03', 'neighbor': [8] },
    1: {
        'id': 1, 'name': '鸿通楼', 'x': '34.58', 'y': '22.43',
        'neighbor': [2]
    },
    2: { 'id': 2, 'name': '鸿通楼+南北路1+东西路1', 'x': '48.64', 'y': '28.67', 'neighbor': [1, 3, 18] },
    3: {
        'id': 3, 'name': '南北路1+ 邮局 + 教四楼西门', 'x': '48.81', 'y': '52.92', 'neighbor': [2, 4, 5, 6]
    },
    4: { 'id': 4, 'name': '邮局', 'x': '41.94', 'y': '52.56', 'neighbor': [3] },
    5: { 'id': 5, 'name': '教四楼西门', 'x': '54.29', 'y': '55.8', 'neighbor': [3] },
    6: { 'id': 6, 'name': '南北路1 + 东西路2 + 移动营业厅', 'x': '49.15', 'y': '80.9', 'neighbor': [3, 7, 8, 13] },
    7: { 'id': 7, 'name': '移动营业厅', 'x': '42.46', 'y': '85.17', 'neighbor': [6] },
    8: {
        'id': 8, 'name': '南北路1+西门', 'x': '48.46', 'y': '113.9', 'neighbor': [6, 0, 9, 14]
    },
    9: { 'id': 9, 'name': '南北路1+东西路3+停车坪', 'x': '48.46', 'y': '134.66', 'neighbor': [8, 10, 15] },
    10: { 'id': 10, 'name': '南北路1+教三楼西门', 'x': '49.14', 'y': '157.72', 'neighbor': [9, 11] },
    11: { 'id': 11, 'name': '南北路1+东西路4+校车车库', 'x': '49.19', 'y': '181.9', 'neighbor': [10, 32] },
    12: { 'id': 12, 'name': '教四楼南门', 'x': '87.9', 'y': '66.66', 'neighbor': [13] },
    13: { 'id': 13, 'name': '东西路2+教四楼南门', 'x': '89.99', 'y': '81.74', 'neighbor': [6, 12, 14, 25] },
    14: { 'id': 14, 'name': '校训石', 'x': '90.38', 'y': '107.81', 'neighbor': [8, 13, 16, 17] },
    15: { 'id': 15, 'name': '东西路3+教三楼北门', 'x': '90.03', 'y': '133.71', 'neighbor': [9, 14, 16, 28] },
    16: { 'id': 16, 'name': '教三楼北门', 'x': '89.09', 'y': '139.91', 'neighbor': [15] },
    17: { 'id': 17, 'name': '主席像', 'x': '110.21', 'y': '108.88', 'neighbor': [14, 26] },
    18: { 'id': 18, 'name': '南北路2+东西路1', 'x': '133.88', 'y': '28.96', 'neighbor': [2, 19, 36] },
    19: { 'id': 19, 'name': '南北路2+财务处+后勤楼', 'x': '133.88', 'y': '42.23', 'neighbor': [18, 20, 21, 22] },
    20: { 'id': 20, 'name': '财务处', 'x': '142.45', 'y': '38.24', 'neighbor': [19, 21] },
    21: { 'id': 21, 'name': '后勤楼', 'x': '142.81', 'y': '44.44', 'neighbor': [19, 20] },
    22: { 'id': 22, 'name': '南北路2+教四楼东门+教一楼西门', 'x': '134.18', 'y': '59.36', 'neighbor': [19, 23, 24, 25] },
    23: {
        'id': 23, 'name': '教四楼东门', 'x': '126.43',
        'y': '56.24', 'neighbor': [22]
    },
    24: { 'id': 24, 'name': '教一楼西门', 'x': '143.48', 'y': '65.26', 'neighbor': [22] },
    25: { 'id': 25, 'name': '南北路2+东西路2', 'x': '134.11', 'y': '81.74', 'neighbor': [13, 22, 26, 37] },
    26: { 'id': 26, 'name': '南北路2+主席像+国旗', 'x': '133.85', 'y': '108.46', 'neighbor': [17, 25, 27, 28] },
    27: { 'id': 27, 'name': '国旗', 'x': '148.28', 'y': '108.62', 'neighbor': [26, 38] },
    28: { 'id': 28, 'name': '南北路2+东西路3', 'x': '134.36', 'y': '136.42', 'neighbor': [15, 26, 29, 40] },
    29: { 'id': 29, 'name': '南北路2+教三楼东门+教二楼西门', 'x': '134.43', 'y': '157.77', 'neighbor': [28, 30, 31, 32] },
    30: { 'id': 30, 'name': '教三楼东门', 'x': '124.91', 'y': '158.5', 'neighbor': [29] },
    31: { 'id': 31, 'name': '教二楼西门', 'x': '143.98', 'y': '158.91', 'neighbor': [29] },
    32: { 'id': 32, 'name': '南北路2 + 东西路4', 'x': '132.77', 'y': '182.7', 'neighbor': [11, 29, 33, 34, 49] },
    33: { 'id': 33, 'name': '中门邮局', 'x': '140.08', 'y': '190.8', 'neighbor': [32] },
    34: { 'id': 34, 'name': '南北路2 + 东西路5', 'x': '133.56', 'y': '203.02', 'neighbor': [32, 35] },
    35: { 'id': 35, 'name': '校医院', 'x': '112.42', 'y': '203.02', 'neighbor': [34] },
    36: { 'id': 36, 'name': '东西路1 + 行政办公楼', 'x': '183.37', 'y': '29.7', 'neighbor': [18, 42] },
    37: { 'id': 37, 'name': '东西路2 + 教一楼南门', 'x': '177.25', 'y': '78.45', 'neighbor': [25, 38, 45] },
    38: { 'id': 38, 'name': '音乐喷泉', 'x': '169.39', 'y': '109.13', 'neighbor': [27, 37, 39, 40] },
    39: { 'id': 39, 'name': '主楼', 'x': '184.57', 'y': '109.43', 'neighbor': [38] },
    40: { 'id': 40, 'name': '东西路3 + 教二楼北门', 'x': '177.12', 'y': '135.65', 'neighbor': [28, 38, 41, 47] },
    41: { 'id': 41, 'name': '教二楼北门', 'x': '178.02', 'y': '147.48', 'neighbor': [40] },
    42: { 'id': 42, 'name': '南北路3 + 东西路1', 'x': '220.34', 'y': '28.48', 'neighbor': [36, 43, 50] },
    43: { 'id': 43, 'name': '南北路3 + 教一楼东门', 'x': '220.26', 'y': '69.58', 'neighbor': [42, 44, 45] },
    44: { 'id': 44, 'name': '教一楼东门', 'x': '213.98', 'y': '68.76', 'neighbor': [43] },
    45: { 'id': 45, 'name': '南北路3 + 东西路2', 'x': '220.09', 'y': '81.74', 'neighbor': [37, 43, 52, 46] },
    46: { 'id': 46, 'name': '南北路3 + 科学会堂西门', 'x': '221.22', 'y': '111.16', 'neighbor': [45, 47] },
    47: { 'id': 47, 'name': '南北路3 + 东西路3', 'x': '218.65', 'y': '134.36', 'neighbor': [40, 46, 48, 53, 56] },
    48: {
        'id': 48, 'name': '南北路3 + 教二楼东门', 'x': '215.32', 'y': '159.76', 'neighbor': [47, 49]
    },
    49: { 'id': 49, 'name': '南北路3 + 东西路4', 'x': '214.96', 'y': '182.7', 'neighbor': [32, 48, 54, 55] },
    50: { 'id': 50, 'name': '南北路4 + 东西路1', 'x': '256.56', 'y': '28.88', 'neighbor': [42, 51] },
    51: { 'id': 51, 'name': '南北路4 + 东西路2', 'x': '256.21', 'y': '81.74', 'neighbor': [50, 52, 53] },
    52: { 'id': 52, 'name': '东西路2 + 科学会堂北门', 'x': '239.27', 'y': '81.74', 'neighbor': [45, 51] },
    53: { 'id': 53, 'name': '南北路4 + 东西路3', 'x': '256.41', 'y': '135.59', 'neighbor': [47, 51, 54, 56] },
    54: { 'id': 54, 'name': '南北路4 + 东西路4', 'x': '255.89', 'y': '182.85', 'neighbor': [49, 53, 55] },
    55: { 'id': 55, 'name': '东西路4 + 创新中心南门', 'x': '236.4', 'y': '178.15', 'neighbor': [49, 54] },
    56: { 'id': 56, 'name': '李白烈士雕像', 'x': '249.19', 'y': '128.53', 'neighbor': [47, 53] }
}

// function a() {
//     let arr = [];
//     for (let i = 0; i <= 56; i++) {
//         let item = buptmapping[i];
//         let neighbors = [];
//         for (let neighbor of item.neighbor) {
//             neighbors.push({
//                 "id": neighbor
//             })
//         }
//         let json = {
//             "id": i,
//             "neighbors": neighbors
//         }
//         arr.push(json);
//     }
//     console.log(JSON.stringify(arr));
// }
// a();

const buptmap = [
    {
        "id": 0,
        "neighbors": [
            {
                "id": 8
            }
        ]
    },
    {
        "id": 1,
        "neighbors": [
            {
                "id": 2
            }
        ]
    },
    {
        "id": 2,
        "neighbors": [
            {
                "id": 1
            },
            {
                "id": 3
            },
            {
                "id": 18
            }
        ]
    },
    {
        "id": 3,
        "neighbors": [
            {
                "id": 2
            },
            {
                "id": 4
            },
            {
                "id": 5
            },
            {
                "id": 6
            }
        ]
    },
    {
        "id": 4,
        "neighbors": [
            {
                "id": 3
            }
        ]
    },
    {
        "id": 5,
        "neighbors": [
            {
                "id": 3
            }
        ]
    },
    {
        "id": 6,
        "neighbors": [
            {
                "id": 3
            },
            {
                "id": 7
            },
            {
                "id": 8
            },
            {
                "id": 13
            }
        ]
    },
    {
        "id": 7,
        "neighbors": [
            {
                "id": 6
            }
        ]
    },
    {
        "id": 8,
        "neighbors": [
            {
                "id": 6
            },
            {
                "id": 0
            },
            {
                "id": 9
            },
            {
                "id": 14
            }
        ]
    },
    {
        "id": 9,
        "neighbors": [
            {
                "id": 8
            },
            {
                "id": 10
            },
            {
                "id": 15
            }
        ]
    },
    {
        "id": 10,
        "neighbors": [
            {
                "id": 9
            },
            {
                "id": 11
            }
        ]
    },
    {
        "id": 11,
        "neighbors": [
            {
                "id": 10
            },
            {
                "id": 32
            }
        ]
    },
    {
        "id": 12,
        "neighbors": [
            {
                "id": 13
            }
        ]
    },
    {
        "id": 13,
        "neighbors": [
            {
                "id": 6
            },
            {
                "id": 12
            },
            {
                "id": 14
            },
            {
                "id": 25
            }
        ]
    },
    {
        "id": 14,
        "neighbors": [
            {
                "id": 8
            },
            {
                "id": 13
            },
            {
                "id": 16
            },
            {
                "id": 17
            }
        ]
    },
    {
        "id": 15,
        "neighbors": [
            {
                "id": 9
            },
            {
                "id": 14
            },
            {
                "id": 16
            },
            {
                "id": 28
            }
        ]
    },
    {
        "id": 16,
        "neighbors": [
            {
                "id": 15
            }
        ]
    },
    {
        "id": 17,
        "neighbors": [
            {
                "id": 14
            },
            {
                "id": 26
            }
        ]
    },
    {
        "id": 18,
        "neighbors": [
            {
                "id": 2
            },
            {
                "id": 19
            },
            {
                "id": 36
            }
        ]
    },
    {
        "id": 19,
        "neighbors": [
            {
                "id": 18
            },
            {
                "id": 20
            },
            {
                "id": 21
            },
            {
                "id": 22
            }
        ]
    },
    {
        "id": 20,
        "neighbors": [
            {
                "id": 19
            },
            {
                "id": 21
            }
        ]
    },
    {
        "id": 21,
        "neighbors": [
            {
                "id": 19
            },
            {
                "id": 20
            }
        ]
    },
    {
        "id": 22,
        "neighbors": [
            {
                "id": 19
            },
            {
                "id": 23
            },
            {
                "id": 24
            },
            {
                "id": 25
            }
        ]
    },
    {
        "id": 23,
        "neighbors": [
            {
                "id": 22
            }
        ]
    },
    {
        "id": 24,
        "neighbors": [
            {
                "id": 22
            }
        ]
    },
    {
        "id": 25,
        "neighbors": [
            {
                "id": 13
            },
            {
                "id": 22
            },
            {
                "id": 26
            },
            {
                "id": 37
            }
        ]
    },
    {
        "id": 26,
        "neighbors": [
            {
                "id": 17
            },
            {
                "id": 25
            },
            {
                "id": 27
            },
            {
                "id": 28
            }
        ]
    },
    {
        "id": 27,
        "neighbors": [
            {
                "id": 26
            },
            {
                "id": 38
            }
        ]
    },
    {
        "id": 28,
        "neighbors": [
            {
                "id": 15
            },
            {
                "id": 26
            },
            {
                "id": 29
            },
            {
                "id": 40
            }
        ]
    },
    {
        "id": 29,
        "neighbors": [
            {
                "id": 28
            },
            {
                "id": 30
            },
            {
                "id": 31
            },
            {
                "id": 32
            }
        ]
    },
    {
        "id": 30,
        "neighbors": [
            {
                "id": 29
            }
        ]
    },
    {
        "id": 31,
        "neighbors": [
            {
                "id": 29
            }
        ]
    },
    {
        "id": 32,
        "neighbors": [
            {
                "id": 11
            },
            {
                "id": 29
            },
            {
                "id": 33
            },
            {
                "id": 34
            },
            {
                "id": 49
            }
        ]
    },
    {
        "id": 33,
        "neighbors": [
            {
                "id": 32
            }
        ]
    },
    {
        "id": 34,
        "neighbors": [
            {
                "id": 32
            },
            {
                "id": 35
            }
        ]
    },
    {
        "id": 35,
        "neighbors": [
            {
                "id": 34
            }
        ]
    },
    {
        "id": 36,
        "neighbors": [
            {
                "id": 18
            },
            {
                "id": 42
            }
        ]
    },
    {
        "id": 37,
        "neighbors": [
            {
                "id": 25
            },
            {
                "id": 38
            },
            {
                "id": 45
            }
        ]
    },
    {
        "id": 38,
        "neighbors": [
            {
                "id": 27
            },
            {
                "id": 37
            },
            {
                "id": 39
            },
            {
                "id": 40
            }
        ]
    },
    {
        "id": 39,
        "neighbors": [
            {
                "id": 38
            }
        ]
    },
    {
        "id": 40,
        "neighbors": [
            {
                "id": 28
            },
            {
                "id": 38
            },
            {
                "id": 41
            },
            {
                "id": 47
            }
        ]
    },
    {
        "id": 41,
        "neighbors": [
            {
                "id": 40
            }
        ]
    },
    {
        "id": 42,
        "neighbors": [
            {
                "id": 36
            },
            {
                "id": 43
            },
            {
                "id": 50
            }
        ]
    },
    {
        "id": 43,
        "neighbors": [
            {
                "id": 42
            },
            {
                "id": 44
            },
            {
                "id": 45
            }
        ]
    },
    {
        "id": 44,
        "neighbors": [
            {
                "id": 43
            }
        ]
    },
    {
        "id": 45,
        "neighbors": [
            {
                "id": 37
            },
            {
                "id": 43
            },
            {
                "id": 52
            },
            {
                "id": 46
            }
        ]
    },
    {
        "id": 46,
        "neighbors": [
            {
                "id": 45
            },
            {
                "id": 47
            }
        ]
    },
    {
        "id": 47,
        "neighbors": [
            {
                "id": 40
            },
            {
                "id": 46
            },
            {
                "id": 48
            },
            {
                "id": 53
            },
            {
                "id": 56
            }
        ]
    },
    {
        "id": 48,
        "neighbors": [
            {
                "id": 47
            },
            {
                "id": 49
            }
        ]
    },
    {
        "id": 49,
        "neighbors": [
            {
                "id": 32
            },
            {
                "id": 48
            },
            {
                "id": 54
            },
            {
                "id": 55
            }
        ]
    },
    {
        "id": 50,
        "neighbors": [
            {
                "id": 42
            },
            {
                "id": 51
            }
        ]
    },
    {
        "id": 51,
        "neighbors": [
            {
                "id": 50
            },
            {
                "id": 52
            },
            {
                "id": 53
            }
        ]
    },
    {
        "id": 52,
        "neighbors": [
            {
                "id": 45
            },
            {
                "id": 51
            }
        ]
    },
    {
        "id": 53,
        "neighbors": [
            {
                "id": 47
            },
            {
                "id": 51
            },
            {
                "id": 54
            },
            {
                "id": 56
            }
        ]
    },
    {
        "id": 54,
        "neighbors": [
            {
                "id": 49
            },
            {
                "id": 53
            },
            {
                "id": 55
            }
        ]
    },
    {
        "id": 55,
        "neighbors": [
            {
                "id": 49
            },
            {
                "id": 54
            }
        ]
    },
    {
        "id": 56,
        "neighbors": [
            {
                "id": 47
            },
            {
                "id": 53
            }
        ]
    }
]

